#include <stdio.h>

int cal_Y(int mjd)
{
	int ty = (int)((mjd - 15078.2) / 365.25);
	int tm = (int)((mjd - 14956.1 - (int)(ty * 365.25)) / 30.6001);
	int k;
	if(tm == 14 || tm == 15) k = 1;
	else k = 0;
	return (ty + k);   
}

int cal_M(int mjd)
{
	int ty = (int)((mjd - 15078.2) / 365.25);
	int tm = (int)((mjd - 14956.1 - (int)(ty * 365.25)) / 30.6001);
	int k;
	if(tm == 14 || tm == 15) k = 1;
	else k = 0;
	return (tm - 1 - k * 12);   
}

int cal_D(int mjd)
{
	int ty = (int)((mjd - 15078.2) / 365.25);
	int tm = (int)((mjd - 14956.1 - (int)(ty * 365.25)) / 30.6001);
	int d;
	d = mjd - 14956 - (int)(ty * 365.25) - (int)(tm * 30.6001);
	return d;  
}
/*Y ́ = int[(MJD-15078.2)/365.25......................................................(B.1)*/
/*M ́ = int{[MJD-14956.1-int(Y ́×365.25)]/30.6001}............................(B.2)*/
/*D = MJD-14956-int(Y ́×365.25)-int(M ́×30.6001)............................(B.3)*/
/*如果M ́ == 14或M ́ == 15,那么K = 1;否则K = 0*/
/*Y = Y ́+K........................................................................................(B.4)*/
/*M = M ́-1-K×12................................................................................(B.5)*/


int
main()
{
	int mjd = 52469;
	int y = cal_Y(mjd);
	int m = cal_M(mjd);
	int d = cal_D(mjd);
	printf("y:%d\nm:%d\nd:%d\n",y,m,d);


}
